### İleri Birleştirme

In [3]:
import pandas as pd

#### one to one

In [11]:
df1 = pd.DataFrame({'calisanlar': ["Ali", "Veli", "Ayşe", "Fatma"],
                    'grup' : ["Muhendislik", "Muhendislik", "İK", "Muhasebe"]})

In [12]:
df2 = pd.DataFrame({'calisanlar': ["Ali", "Veli", "Ayşe", "Fatma"],
                    'ilk_giris' : ["2013", "2001", "2012", "2011"]})

In [13]:
pd.merge(df1,df2)

  calisanlar         grup ilk_giris
0        Ali  Muhendislik      2013
1       Veli  Muhendislik      2001
2       Ayşe           İK      2012
3      Fatma     Muhasebe      2011

In [15]:
pd.merge(df1,df2, on= "calisanlar") # on da kullanılabilir (hangi sütuna bağlı kalarak birleştrme yapılmak isteniyor)

  calisanlar         grup ilk_giris
0        Ali  Muhendislik      2013
1       Veli  Muhendislik      2001
2       Ayşe           İK      2012
3      Fatma     Muhasebe      2011

#### many to one

In [29]:
df3 = pd.merge(df1,df2)

In [23]:
df4 =pd. DataFrame({'grup' : ["Muhendislik", "İK", "Muhasebe"],
                    'mudur': ["Mustafa", "Kazım", "Berkcan"]})

In [24]:
df4

          grup    mudur
0  Muhendislik  Mustafa
1           İK    Kazım
2     Muhasebe  Berkcan

In [25]:
df3

  calisanlar         grup ilk_giris
0        Ali  Muhendislik      2013
1       Veli  Muhendislik      2001
2       Ayşe           İK      2012
3      Fatma     Muhasebe      2011

In [33]:
pd.merge(df3,df4)

  calisanlar         grup ilk_giris    mudur
0        Ali  Muhendislik      2013  Mustafa
1       Veli  Muhendislik      2001  Mustafa
2       Ayşe           İK      2012    Kazım
3      Fatma     Muhasebe      2011  Berkcan

### many to many

In [36]:
df5 = pd.DataFrame({'yetenekler': ["mat", "kodlama", "excel","yönetim", "linux", "mat" ],
                    'grup' : ["Muhendislik", "Muhendislik", "İK","İK", "Muhendislik", "Muhasebe"]})

In [37]:
df5

  yetenekler         grup
0        mat  Muhendislik
1    kodlama  Muhendislik
2      excel           İK
3    yönetim           İK
4      linux  Muhendislik
5        mat     Muhasebe

In [38]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali  Muhendislik        mat
1        Ali  Muhendislik    kodlama
2        Ali  Muhendislik      linux
3       Veli  Muhendislik        mat
4       Veli  Muhendislik    kodlama
5       Veli  Muhendislik      linux
6       Ayşe           İK      excel
7       Ayşe           İK    yönetim
8      Fatma     Muhasebe        mat